//* // МОРСКОЙ БОЙ

export default calcShipsCount
// */

//* // example
console.log(calcShipsCount([])) // 0
console.log(
  calcShipsCount([
    [1, 0, 1, 1, 1, 1],
    [1, 0, 0, 0, 0, 0],
    [0, 0, 1, 1, 0, 0],
    [0, 0, 1, 1, 0, 1],
    [0, 0, 0, 0, 1, 1],
    [0, 0, 0, 0, 1, 0],
  ]),
) // 5
// */

/* // description
Реализуйте и экспортируйте по умолчанию функцию, которая принимает на вход поле боя в виде квадратного двумерного массива из нулей и единиц. Ноль — пустая ячейка, единица — часть корабля. Функция должна вернуть количество кораблей на поле боя.

В отличие от классической игры "Морской бой", в данном варианте корабли могут изгибаться буквой "г" и "змейкой".

Подсказки
При необходимости используйте функции из библиотеки es-toolkit
// */
