/* // Тестирование ошибок
import { test, expect } from 'vitest'
import getFunction from './trial-1.js'

const read = getFunction()

// */

/* // description
Имеется функция read(), которая принимает в качестве аргумента путь до файла в виде строки и читает содержимое указанного файла. Функция синхронная, как fs.readFileSync(), и при ошибке выбрасывает исключение. Напишите в файле __tests__/read.test.js негативные тесты функции read(), проверяющие ошибочные ситуации. Рассмотрите следующие ситуации:

Файл не найден
В функцию передан путь до существующей директории. Директорию как файл прочитать нельзя, поэтому для read() это тоже ошибка

```js
read('/undefined') // Error: ENOENT: no such file or directory, open '/undefined'
read('/etc') // Error: EISDIR: illegal operation on a directory, read
```

Тесты запускаются на правильной реализации read() и на неправильных из файла functions.js. На правильной реализации они должны пройти, а на каждой неправильной упасть, иначе решение не засчитывается.
// */
