/* // ПАРАЛЛЕЛЬНОЕ ВЫПОЛНЕНИЕ ОПЕРАЦИЙ
import fs from 'fs'
import path from 'path'
import async from 'async'
import _ from 'lodash'

export { getDirectorySize }
// */

/* // example

getDirectorySize('./node_modules', (err, size) => {
  console.log(size)
})

// Ошибка
// getDirectorySize('/undefined', (err, size) => {
//   console.error(err)
// })
// */

/* // description
Реализуйте и экспортируйте асинхронную функцию getDirectorySize(), которая считает размер переданной директории, не включая поддиректории. Анализ размера файла должен происходить параллельно, для этого воспользуйтесь библиотекой async

Подсказки

- fs.readdir() — чтение содержимого директории, возвращает файлы и папки в директории
- path.join() — конструирует пути
- async.map() — специальная функция из библиотеки для асинхронной обработки коллекций
- fs.stat() — информация о файле. В получаемом объекте содержится метод isFile() для проверки является ли элемент файлом
- _.sumBy() — нахождение суммы в массиве
  колбек должен вызываться и в случае ошибки
// */
