/* // Список файлов и директорий
import zipWith from 'es-toolkit/compat/zipWith'
import path from 'path'
import fsp from 'fs/promises'


export default ls

// */

/* // description
Реализуйте и экспортируйте по умолчанию в файле ls.js функцию, которая принимает на вход путь (абсолютный или относительный) и возвращает информацию о файлах и директориях, расположенных по этому пути. Функция возвращает промис с массивом объектов, где каждый элемент содержит путь к файлу (filepath) и описание доступов (mode из stats.mode). Объекты в массиве должны быть отсортированы по имени файла в обратном порядке. Путь в filepath всегда абсолютный, даже если функция получила относительный.

Примеры

```js
import ls from './ls.js'

await ls('/var')
// [
//   { filepath: '/var/log', mode: 16877 },
//   { filepath: '/var/lock', mode: 17407 },
//   { filepath: '/var/local', mode: 17917 },
// ];

await ls('/etc/passwd')
// [{ filepath: '/etc/passwd', mode: 33188 }];

await ls('../../../../etc/passwd')
// [{ filepath: '/etc/passwd', mode: 33188 }];
```

Эта функция должна уметь обрабатывать не только директории, но и файлы. В таком случае отдается массив с одним объектом — информацией по текущему файлу.

Подсказки
fsp.readdir() читает директорию и отдаёт имена без пути к ней
fsp.stat() отдаёт информацию о файле. Метод stats.isFile() проверяет, является ли файлом переданный путь, а поле stats.mode описывает доступ
path.resolve() превращает относительный путь в абсолютный
zipWith() это вспомогательная функция из es-toolkit
// */
