/* // new Promise

export default wait
// */

//* // example
// wait(3000).then(() => console.log('time is over!'))
// time is over!
// Сообщение появляется через 100 миллисекунд после вызова
// */

/* // description
Реализуйте в файле timer.js таймер в виде промиса. Функция принимает количество миллисекунд и возвращает промис, который успешно завершается без значения, когда пройдёт это время. Экспортируйте функцию по умолчанию.

Подсказки

- Промис создаётся конструктором new Promise(), и завершает его вызов resolve(). Таймер setTimeout() принимает колбек так же, как fs.readFile(), и resolve() вызывается из этого колбека.
- Promise.resolve() возвращает уже завершённый промис, поэтому дождаться таймера с его помощью нельзя.
// */
