/* // ТАЙМЕРЫ
import fs from 'fs'


export default watch
// */

/* // example
import watch from './watcher.js'

const id = watch(filepath, 500, (err) => {
  console.log('Wow!')
})

setTimeout(() => fs.appendFileSync(filepath, 'ehu'), 700)
setTimeout(() => clearInterval(id), 5000) // остановить отслеживание через 5 секунд
// */

/* // description
Реализуйте и экспортируйте по умолчанию асинхронную функцию, которая следит за изменением файла с заданной периодичностью. Функция должна возвращать идентификатор таймера, запущенного внутри.

Если файл был изменён со времени предыдущей проверки, то необходимо вызвать колбек. Если во время анализа файла (через fs.stat) произошла ошибка, то нужно остановить таймер и вызвать колбек, передав туда ошибку.

Отслеживание изменений файла должно начинаться с момента вызова функции. Параметры функции:

- Путь до файла, который нужно отслеживать
- Период отслеживания
- Колбек, принимающий аргументом ошибку

Функция должна с заданным периодом отслеживать изменения файла и вызывать колбек, если обнаружено изменение файла. После вызова колбека, функция должна продолжать отслеживать изменения. Отслеживание останавливают сами тесты, для этого ваша функция должна возвращать id таймера.

Подсказки

- stats.mtimeMs — время последнего изменения
- Date.now() — текущая дата
- clearInterval
- Для решения используйте setInterval()
// */
