//* // СБАЛАНСИРОВАННОЕ ДВОИЧНОЕ ДЕРЕВО

// */

/* // example
const tree1 = new Node(4, new Node(3, new Node(2)))

console.log(tree1.isBalanced()) // true

const tree2 = new Node(4, new Node(3, new Node(2, new Node(1))))

console.log(tree2.isBalanced()) // false
// */

/* // description
Особенность структуры двоичного дерева даёт хороший прирост к эффективности при поиске нужного значения. Для этого нужно, чтобы двоичное дерево было сбалансированным. То есть необходимо построить дерево так, чтобы общее количество узлов в левом и правом поддеревьях было примерно одинаковым для любого узла дерева.

Реализуйте метод isBalanced(), который проверяет дерево на сбалансированность. Он возвращает true, если количество узлов в левом и правом поддеревьях каждого узла отличается не более, чем на 2. В ином случае метод должен вернуть false.
// */
